app/controllers/reporting_forms/balance_lines_controller.rb

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine')
---
  def index
    @lines = ReportingForms::BalanceLine.all

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine') AND `lines`.`id` = 4 LIMIT 1
---
  def show
    @line = ReportingForms::BalanceLine.find(params[:id])

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine') AND (id <> 0 and total <> 1)
---
  def new
    @line = ReportingForms::BalanceLine.new
    @lines =[]
    @lines =  ReportingForms::BalanceLine.all

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine') AND (id <> '17' and total <> 1)
---
  def edit
    @line = ReportingForms::BalanceLine.find(params[:id])

INSERT INTO `lines` (`code`, `created_at`, `name`, `parent_id`, `sign`, `total`, `type`, `updated_at`) VALUES ('', '2012-03-13 22:12:00', 'АКТИВ', NULL, 'plus', 0, 'BalanceLine', '2012-03-13 22:12:00')
---
  def create
    @line = ReportingForms::BalanceLine.new(params[:reporting_forms_balance_line])

    respond_to do |format|
      if @line.save

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine') AND `lines`.`id` = 7 LIMIT 1
UPDATE `lines` SET `sign` = 'minus', `updated_at` = '2012-03-13 22:21:10' WHERE `lines`.`type` IN ('BalanceLine') AND `lines`.`id` = 33
---
  def update
     @line = ReportingForms::BalanceLine.find(params[:id])

    respond_to do |format|
      if @line.update_attributes(params[:reporting_forms_balance_line])

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine') AND `lines`.`id` = 1 LIMIT 1
DELETE FROM `lines` WHERE `lines`.`type` IN ('BalanceLine') AND `lines`.`id` = 1
---
  def destroy
    @line = ReportingForms::BalanceLine.find(params[:id])
    @line.destroy