app/controllers/reporting_forms/plan_lines_controller.rb

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine')
---
  def index
    @lines = ReportingForms::PlanLine.all

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine') AND `lines`.`id` = 9 LIMIT 1
---
  def show
    @line = ReportingForms::PlanLine.find(params[:id])

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine')
---
  def new
    @line = ReportingForms::PlanLine.new
    @lines =[]
    @lines =  ReportingForms::PlanLine.all

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine') AND (id <> '35' and total <> 1)
---
  def edit
    @line = ReportingForms::PlanLine.find(params[:id])

INSERT INTO `lines` (`code`, `created_at`, `name`, `parent_id`, `sign`, `total`, `type`, `updated_at`) VALUES ('', '2012-03-14 22:26:42', 'I. Формування прибутку підприємства', NULL, 'plus', 0, 'PlanLine', '2012-03-14 22:26:42')
---
  def create
    @line = ReportingForms::PlanLine.new(params[:reporting_forms_plan_line])

    respond_to do |format|
      if @line.save

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine') AND `lines`.`id` = 50 LIMIT 1
UPDATE `lines` SET `name` = 'Адміністративні витрати, усього, у тому числі: ', `updated_at` = '2012-03-14 22:33:51' WHERE `lines`.`type` IN ('PlanLine') AND `lines`.`id` = 50
---
  def update
     @line = ReportingForms::PlanLine.find(params[:id])

    respond_to do |format|
      if @line.update_attributes(params[:reporting_forms_plan_line])

SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine') AND `lines`.`id` = 9 LIMIT 1
DELETE FROM `lines` WHERE `lines`.`type` IN ('PlanLine') AND `lines`.`id` = 9
---
  def destroy
    @line = ReportingForms::PlanLine.find(params[:id])
    @line.destroy