app/controllers/reportings/balances_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def index
    @company = current_user.companies.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def show

    @company = current_user.companies.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 'company_id' LIMIT 1
SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine')
---
  def new
    @company = current_user.companies.find(params[:company_id])
    @report = @company.balances.new
    @report.period = DateTime.current
    @lines = @report.lines
    @line_values = []
    @lines.each do |line|

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('BalanceLine') ORDER BY code DESC
SELECT `values`.* FROM `values` WHERE `values`.`report_id` = 8
INSERT INTO `values` (`created_at`, `line_id`, `report_id`, `updated_at`, `value1`, `value2`, `value3`, `value4`, `value5`) VALUES ('2012-03-13 11:49:36', 10, 10, '2012-03-13 11:49:36', NULL, NULL, NULL, NULL, NULL)
---
  def edit
    @company = current_user.companies.find(params[:company_id])
    @report = @company.balances.find(params[:id])
    @lines = @report.lines
    existing_line_values = @report.values
    existing_line_ids = existing_line_values.map { |rec| rec.line_id }
    @line_values = existing_line_values
    @lines.each do |line|
      if !existing_line_ids.include?(line.id)
        @line_values<<@report.values.build(:line_id=>line.id)

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
INSERT INTO `reports` (`company_id`, `created_at`, `period`, `type`, `updated_at`) VALUES (1, '2012-03-12 21:48:34', '---\nyear: \'2012\'\nmonth: \'3\'\nday: \'12\'\n', 'Reportings::Balance', '2012-03-12 21:48:34')
---
  def create
    @company = current_user.companies.find(params[:company_id])
    @report = @company.balances.new(params[:reportings_balance])
    @report.period = Date.civil(params[:period][:year].to_i, params[:period][:month].to_i, params[:period][:day].to_i)
    respond_to do |format|
      if @report.valid? && @report.save_and_update_parents

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 8 LIMIT 1
UPDATE `reports` SET `period` = '---\nyear: \'2012\'\nmonth: \'3\'\nday: \'13\'\n', `updated_at` = '2012-03-12 22:19:41' WHERE `reports`.`type` IN ('Reportings::Balance') AND `reports`.`id` = 8
---
  def update
    @company = current_user.companies.find(params[:company_id])
    @report = @company.balances.find(params[:id])
    @report.period = Date.civil(params[:period][:year].to_i, params[:period][:month].to_i, params[:period][:day].to_i)
    params[:reportings_balance][:period]=@report.period
    respond_to do |format|
      if @report.valid? && @report.update_attributes_and_update_parents(params[:reportings_balance])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
DELETE FROM `reports` WHERE `reports`.`type` IN ('Reportings::Balance') AND `reports`.`id` = 2
---
  def destroy
    @company = current_user.companies.find(params[:company_id])
    @report = @company.balances.find(params[:id])
    @report.destroy