app/controllers/reportings/plans_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def index
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def show
    @company = Company.find(params[:company_id])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine')
---
  def new
    @company = Company.find(params[:company_id])
    @reportings_plan = @company.plans.new
    @lines = @reportings_plan.lines
    @line_values = []
    @lines.each do |line|

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `lines`.* FROM `lines` WHERE `lines`.`type` IN ('PlanLine')
SELECT `values`.* FROM `values` WHERE `values`.`report_id` = 12
INSERT INTO `values` (`created_at`, `line_id`, `report_id`, `updated_at`, `value1`, `value2`, `value3`, `value4`, `value5`) VALUES ('2012-03-14 22:48:51', 34, 12, '2012-03-14 22:48:51', NULL, NULL, NULL, NULL, NULL)
---
  def edit
    @company = Company.find(params[:company_id])
    @reportings_plan = @company.plans.find(params[:id])
    @lines = @reportings_plan.lines
    existing_line_values = @reportings_plan.values
    existing_line_ids = existing_line_values.map {|rec| rec.line_id}
    @line_values = existing_line_values
    @lines.each do |line|
      if !existing_line_ids.include?(line.id)
         @line_values<<@reportings_plan.values.build(:line_id=>line.id)

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
INSERT INTO `reports` (`company_id`, `created_at`, `period`, `type`, `updated_at`) VALUES (1, '2012-03-13 16:41:46', '2012-03-13', 'Reportings::Plan', '2012-03-13 16:41:46')
INSERT INTO `values` (`created_at`, `line_id`, `report_id`, `updated_at`, `value1`, `value2`, `value3`, `value4`, `value5`) VALUES ('2012-03-13 16:41:46', 9, 12, '2012-03-13 16:41:46', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @company = Company.find(params[:company_id])
    @reportings_plan = @company.plans.new(params[:reportings_plan])
    @reportings_plan.period = Date.civil(params[:reportings_plan][:period][:year].to_i, params[:reportings_plan][:period][:month].to_i, params[:reportings_plan][:period][:day].to_i)
    respond_to do |format|
      if @reportings_plan.save && @reportings_plan.update_parent_in_values && @reportings_plan.update_total_values

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
UPDATE `reports` SET `period` = '2012-03-15', `updated_at` = '2012-03-14 22:24:33' WHERE `reports`.`type` IN ('Reportings::Plan') AND `reports`.`id` = 12
---
  def update
    @company = Company.find(params[:company_id])
    @reportings_plan = @company.plans.find(params[:id])
    @reportings_plan.period = Date.civil(params[:reportings_plan][:period][:year].to_i, params[:reportings_plan][:period][:month].to_i, params[:reportings_plan][:period][:day].to_i)
    params[:reportings_plan][:period]=@reportings_plan.period
    respond_to do |format|
      if @reportings_plan.update_attributes_and_update_parents(params[:reportings_plan])

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
DELETE FROM `reports` WHERE `reports`.`type` IN ('Reportings::Plan') AND `reports`.`id` = 13
---
  def destroy
    @company = Company.find(params[:company_id])
    @reportings_plan = @company.plans.find(params[:id])
    @reportings_plan.destroy