app/controllers/companies_controller.rb

  def index
    @group1 = current_user.companies.group1
---
SELECT `companies`.* FROM `companies`

  def show
    @company = current_user.companies.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def edit
    @company = current_user.companies.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def create
    @company = current_user.companies.new(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`created_at`, `name`, `updated_at`) VALUES ('2012-03-12 08:43:20', 'anykey&Co', '2012-03-12 08:43:20')

  def update
    @company = current_user.companies.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
UPDATE `companies` SET `name` = 'anykey&Coффф', `updated_at` = '2012-03-13 13:22:26' WHERE `companies`.`id` = 1