app/controllers/reportings_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def index
    @company = Company.find(params[:company_id])